Revit 2027 API
ConnectionResolution Enumeration
 An enumerated type listing all the possible resolutions for connectivity validation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConnectionResolution
Public Enumeration ConnectionResolution
public enum class ConnectionResolution
type ConnectionResolution
Members
Member name | Value | Description
Disconnected | 0 |  Value for parts were disconnected.
See Also
Reference
Autodesk.Revit.DB Namespace